"""
https://www.chessprogramming.org/Simplified_Evaluation_Function
"""
from chess import Board, Move

KNIGHT_TABLE = [-50,-40,-30,-30,-30,-30,-40,-50,
                -40,-20,  0,  0,  0,  0,-20,-40,
                -30,  0, 10, 15, 15, 10,  0,-30,
                -30,  5, 15, 20, 20, 15,  5,-30,
                -30,  0, 15, 20, 20, 15,  0,-30,
                -30,  5, 10, 15, 15, 10,  5,-30,
                -40,-20,  0,  5,  5,  0,-20,-40,
                -50,-40,-30,-30,-30,-30,-40,-50,]

BISHOP_TABLE = [-20,-10,-10,-10,-10,-10,-10,-20,
                -10,  0,  0,  0,  0,  0,  0,-10,
                -10,  0,  5, 10, 10,  5,  0,-10,
                -10,  5,  5, 10, 10,  5,  5,-10,
                -10,  0, 10, 10, 10, 10,  0,-10,
                -10, 10, 10, 10, 10, 10, 10,-10,
                -10,  5,  0,  0,  0,  0,  5,-10,
                -20,-10,-10,-10,-10,-10,-10,-20,]

ROOK_TABLE =   [0,  0,  0,  0,  0,  0,  0,  0,
                5, 10, 10, 10, 10, 10, 10,  5,
               -5,  0,  0,  0,  0,  0,  0, -5,
               -5,  0,  0,  0,  0,  0,  0, -5,
               -5,  0,  0,  0,  0,  0,  0, -5,
               -5,  0,  0,  0,  0,  0,  0, -5,
               -5,  0,  0,  0,  0,  0,  0, -5,
                0,  0,  0,  5,  5,  0,  0,  0]

QUEEN_TABLE = [-20,-10,-10, -5, -5,-10,-10,-20,
               -10,  0,  0,  0,  0,  0,  0,-10,
               -10,  0,  5,  5,  5,  5,  0,-10,
                -5,  0,  5,  5,  5,  5,  0, -5,
                 0,  0,  5,  5,  5,  5,  0, -5,
               -10,  5,  5,  5,  5,  5,  0,-10,
               -10,  0,  5,  0,  0,  0,  0,-10,
               -20,-10,-10, -5, -5,-10,-10,-20]

PAWN_TABLE =  [0,  0,  0,  0,  0,  0,  0,  0,
              50, 50, 50, 50, 50, 50, 50, 50,
              10, 10, 20, 30, 30, 20, 10, 10,
               5,  5, 10, 25, 25, 10,  5,  5,
               0,  0,  0, 20, 20,  0,  0,  0,
               5, -5,-10,  0,  0,-10, -5,  5,
               5, 10, 10,-20,-20, 10, 10,  5,
               0,  0,  0,  0,  0,  0,  0,  0]

KING_TABLE = [-50,-40,-30,-20,-20,-30,-40,-50,
              -30,-20,-10,  0,  0,-10,-20,-30,
              -30,-10, 10, 15, 15, 10,-10,-30,
              -30,-10, 15, 20, 20, 15,-10,-30,
              -30,-10, 15, 20, 20, 15,-10,-30,
              -30,-10, 10, 10, 10, 10,-10,-30,
               15, 15,  0,  0,  0,  0, 15, 15,
               15, 20, 10,  0,  0, 10, 20, 15]

PIECES = [PAWN_TABLE, KNIGHT_TABLE, BISHOP_TABLE, ROOK_TABLE, QUEEN_TABLE, KING_TABLE]

def get_move_static_score(board: Board, move: Move) -> int:
    """
    Trả về điểm số tĩnh của nước đi (chỉ được sử dụng để sắp xếp nước đi).
    
    static_score = to_square - from_square (có từng bảng riêng cho từng loại quân cờ)
    """
    piece = board.piece_at(move.from_square)
    if piece.color:
        return PIECES[piece.piece_type - 1][move.to_square] - PIECES[piece.piece_type - 1][move.from_square]
    return PIECES[piece.piece_type - 1][move.to_square ^ 56] - PIECES[piece.piece_type - 1][move.from_square ^ 56]